Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Instead, the Gui object is passed directly to a for-loop, which calls __Enum once and then calls the enumerator once for each iteration of the loop.
ja: その代わりに、Guiオブジェクトは直接forループに渡され、forループは__Enumを一度呼び出し、ループの各繰り返しで列挙器を一度呼び出します。

source: Instead, the array object is passed directly to a for-loop, which calls __Enum once and then calls the enumerator once for each iteration of the loop.
ja: その代わり、配列オブジェクトは直接forループに渡され、forループは__Enumを一度呼び出し、ループの各繰り返しで列挙器を一度呼び出します。

source: Instead, the caller must explicitly pass a reference with the reference operator (&var).
ja: その代わり、呼び出し側は参照演算子（&var）を使って明示的に参照を渡す必要があります。

source: Instead, the insertion point (caret) is typically positioned wherever it was last time the control had focus.
ja: 代わりに、挿入点（キャレット）は、通常、コントロールが最後にフォーカスを持ったときの位置に配置されます。

source: Instead, the map object is passed directly to a for-loop, which calls __Enum once and then calls the enumerator once for each iteration of the loop.
ja: その代わり、マップオブジェクトは直接forループに渡され、forループは__Enumを一度呼び出し、ループの各繰り返しで列挙器を一度呼び出します。

source: Instead, the program looks for a Win32 (RCDATA) resource named ">AUTOHOTKEY SCRIPT<" and loads that, or fails if it is not found.
ja: 代わりに、プログラムは「>AUTOHOTKEY SCRIPT<」という名前のWin32 (RCDATA)リソースを探し、それをロードするか、見つからなければ失敗する。

source: Instead, they are treated the same as strings stored in variables or returned from functions.
ja: 代わりに、変数に格納された文字列や関数から返された文字列と同じように扱われます。

source: Instead, they throw an exception on failure.
ja: その代わり、失敗すると例外を投げます。

source: Instead, this option serves as a hint to the control that allows it to allocate memory only once rather than each time a row is added, which greatly improves row-adding performance (it may also improve sorting performance).
ja: その代わり、このオプションはコントロールへのヒントとして機能し、行を追加するたびにメモリを確保するのではなく、一度だけメモリを確保することができます。

source: Instead, timed functions are treated just like other threads:
ja: その代わり、タイムドファンクションは他のスレッドと同じように扱われます：

source: Instead, timed functions are treated just like other threads: they can interrupt or be interrupted by another thread, such as a hotkey subroutine.
ja: その代わり、タイムドファンクションは他のスレッドと同じように扱われます：ホットキーのサブルーチンなど、他のスレッドに割り込んだり、割り込まれたりする可能性があります。

source: Instead, turn off the existing hotstring and create a new one.
ja: 代わりに、既存のホットストリングをオフにして、新しいホットストリングを作成します。

source: Instead, use Run in conjunction with A_AhkPath and A_ScriptFullPath (and A_IsCompiled if the script is ever used in compiled form).
ja: 代わりに、A_AhkPathと A_ScriptFullPath（およびスクリプトがコンパイルされた状態で使用される場合はA_IsCompiled）と組み合わせてRunを使用します。

source: Instead, use StrPut to calculate the required buffer size.
ja: 代わりに、StrPutを使用して必要なバッファサイズを計算します。

source: Instead, use #SuspendExempt or the S option.
ja: 代わりに、#SuspendExemptまたはSオプションを使用してください。

source: Instead, use multiple functions and call one from the other.
ja: その代わり、複数の機能を使い、他の機能から呼び出すようにします。

source: Instead, use the SendInput function beneath the abbreviation, followed by a line containing only the word Return.
ja: 代わりに、省略形の下にSendInput関数を使用し、その後にReturnという単語だけを含む行が続きます。

source: Instead, use the built-in column methods.
ja: 代わりに、組み込みのカラムメソッドを使用します。

source: Instead, variables and other values can be combined with text through a process called concatenation.
ja: その代わりに、変数やその他の値をテキストと結合させるための処理として 連結。

source: Instructions for specific editors
ja: 特定のエディターへの指示

source: Int := ControlGetIndex(...) ; For Tab, LB, CB, DDL
ja: Int := ControlGetIndex(...) ; Tab、LB、CB、DDL用

source: Integer - Syntax & Usage | AutoHotkey v2
ja: Integer - 構文と使用法｜AutoHotkey v2

source: Integer and Float extend Number.
ja: 整数と浮動小数点数はNumberを拡張しています。

source: Integer constants and numeric strings outside of the supported range (of 64-bit signed integers) now overflow/wrap around, instead of being capped at the min/max value.
ja: 64ビット符号付き整数のサポート範囲外の整数定数や数値文字列は、最小/最大値で上限が設定されるのではなく、オーバーフロー/ラップアラウンドするようになりました。

source: Integer is actually a class, but can be called as a function.
ja: Integerは実際にはクラスですが、関数として呼び出すことができます。

source: Integers in the 32-bit range are still passed as VT_I4.
ja: 32ビット範囲の整数はVT_I4として渡されます。

source: Integers must be within the signed 64-bit range; that is, -9223372036854775808 (-0x8000000000000000, or -263) to 9223372036854775807 (0x7FFFFFFFFFFFFFFF, or 263-1).
ja: つまり、-9223372036854775808（-0x800000000000、または，-263）から9223372036854775807（0x7FFFFFFFFF、または、263-1）の範囲内でなければなりません。

source: IntelliSense
ja: インテリセンス

source: Interactive Debugging
ja: インタラクティブ・デバッグ

source: Interactive debugging
ja: インタラクティブなデバッギング

source: Interactive debugging is possible with a supported DBGp client.
ja: サポートされているDBGpクライアントがあれば、インタラクティブなデバッグが可能です。

source: Internal calls to other meta-functions or double-underscore methods do not trigger __Call.
ja: 他のメタファンクションやダブルアンダースコアメソッドへの内部呼び出しは__Callをトリガーしない。

source: Interpreting the parameters correctly requires some understanding of how the x86 calling conventions work.
ja: パラメータを正しく解釈するには、x86の呼び出し規約がどのように機能するかをある程度理解する必要があります。

source: Intervening lines of blanks and comments only are ignored, as are any intervening compiler directive lines.
ja: 空白やコメントだけの行は無視され、コンパイラ指令の行も無視される。

source: Introduction
ja: はじめに

source: Introduction and Simple Example
ja: 導入と簡単な例

source: Introduction and Simple Examples
ja: 導入と簡単な例

source: Invalid addresses must not be used.
ja: 無効なアドレスは使用しないでください。

source: Invalid key name.
ja: 無効なキー名です。

source: Invalid parameters were detected.
ja: 無効なパラメータが検出されました。

source: Invalid values throw an exception.
ja: 無効な値では例外が発生します。

source: Invokes a menu item from the menu bar of the specified window.
ja: 指定されたウィンドウのメニューバーからメニュー項目を呼び出します。

source: Invoking super.x when the superclass has no definition of x throws an error, whereas base.x was previously ignored (even if it was an assignment).
ja: スーパークラスに x の定義がない場合に super.x を起動するとエラーが発生しますが、これまでは base.x は（たとえそれが割り当てであっても）無視されていました。

source: Is Functions
ja: Is関数

source: Is it possible to turn it into a hotkey?
ja: ホットキーにすることは可能なのでしょうか？

source: Is it really a virus?
ja: 本当にウイルスなのでしょうか？

source: IsChecked := (ItemState >> 12) - 1 ; This sets IsChecked to true if RowNumber is checked or false otherwise.
ja: IsChecked := (ItemState >> 12) - 1 ; RowNumberがチェックされていればIsCheckedをtrueに、そうでなければfalseに設定します。

source: IsLabel - Syntax & Usage | AutoHotkey v2
ja: IsLabel - 構文と使用法｜AutoHotkey v2

source: IsObject - Syntax & Usage | AutoHotkey v2
ja: IsObject - 構文と使用法｜AutoHotkey v2

source: IsSet / IsSetRef - Syntax & Usage | AutoHotkey v2
ja: IsSet / IsSetRef - 構文と使用法｜AutoHotkey v2

source: IsSet can be used to avoid this, such as for initializing a global or static variable on first use.
ja: IsSetは、グローバル変数や静的変数の初回使用時の初期化など、これを回避するために使用することができます。

source: IsSet cannot be called indirectly because any attempt to pass an uninitialized variable would cause an error to be thrown.
ja: 初期化されていない変数を渡そうとするとエラーが発生するため、IsSetを間接的に呼び出すことはできない。

source: IsSetRef can also be used to check a specific variable, by using it with the reference operator.
ja: IsSetRefは、参照演算子と併用することで、特定の変数をチェックすることも可能です。

source: Issues:
ja: 課題：

source: It allows each button to drag just like a mouse button and it uses virtually no CPU time.
ja: 各ボタンをマウスボタンと同じようにドラッグすることができ、CPU時間をほとんど消費しない。

source: It allows the user to click and release the mouse button easily without unintentionally starting a drag operation.
ja: これにより、ドラッグ操作を不用意に開始することなく、マウスボタンを簡単にクリックしたり離したりすることができる。

source: It also affects whether hidden windows identified by HWND (as an Object property or Integer) are detected, but only when used with WinWait or WinWaitClose.
ja: また、（オブジェクト・プロパティまたは整数として）HWNDによって識別される隠しウィンドウが検出されるかどうかにも影響しますが、これはWinWaitまたはWinWaitCloseと共に使用される場合のみです。

source: It also allows the object to be passed directly to NumPut or NumGet, which may be used with VT_BYREF (access the caller's typed variable), VT_ARRAY (access SAFEARRAY fields) or VT_UNKNOWN (retrieve vtable pointer).
ja: また、VT_BYREF（呼び出し元の型付き変数にアクセス）、VT_ARRAY（SAFEARRAYフィールドにアクセス）、VT_UNKNOWN（vtableポインタを取得）で使用できるNumPutやNumGetにオブジェクトを直接渡すことができます。

source: It also considers files, such as those copied in an Explorer window via Ctrl+C, to be text.
ja: また、エクスプローラーウィンドウでCtrl+Cでコピーしたようなファイルもテキストとみなします。

source: It also ensures variable names are not joined with other tokens (or names), causing invalid expressions.
ja: また、変数名が他のトークン（または名前）と結合して無効な式になることがないようにします。

source: It also features customizable movement speed, acceleration, and "axis inversion".
ja: また、移動速度、加速度、「軸の反転」をカスタマイズできるのも特徴だ。

source: It also has a title and contains an info icon.
ja: また、タイトルがあり、情報アイコンが含まれている。

source: It also has no effect for hotkeys which already require the keyboard hook, including any keyboard hotkeys with the tilde (~) or wildcard (*) modifiers, key-up hotkeys and custom combinations.
ja: また、チルダ（~）またはワイルドカード(*)修飾子を持つキーボードホットキー、キーアップホットキー、カスタムコンビネーションなど、すでにキーボードフックを必要としているホットキーには効果がありません。

source: It also includes a Win+H hotkey to make it easy to add more misspellings:
ja: また、Win+Hのホットキーを搭載しているので、より多くの誤字脱字を簡単に追加することができます：

source: It also makes Ctrl+Alt+X produce Ctrl+Alt+C, etc.
ja: また、Ctrl+Alt+XがCtrl+Alt+Cなどを生成する。

source: It also makes the script execute more efficiently, but not by much.
ja: また、スクリプトをより効率的に実行できるようになりますが、それほど大きな差はありません。

source: It also matches at the very beginning of any string that contains no "a" at all.
ja: また、「a」をまったく含まない文字列の先頭にもマッチする。

source: It also prevents key combinations which don't actually produce the given end characters from ending input; for example, if @ is an end key, on the US layout Shift+2 will trigger it but Ctrl+Shift+2 will not (if the E option is used).
ja: また、与えられた終了文字を実際に生成しないキーの組み合わせが入力を終了するのを防ぎます。例えば、@が終了キーである場合、USレイアウトではShift+2が、それをトリガーしますが Ctrl+Shift+2はそうではありません（Eオプションが使用されている場合）。

source: It also prevents the "minimize" system sound from being played.
ja: また、「最小化」システムサウンドが再生されることもない。

source: It also serves as a demonstration of the dbgp.ahk library.
ja: また、dbgp.ahkライブラリのデモも兼ねています。

source: It also supports a few other features such as the InputHook function.
ja: また、InputHook機能など、いくつかの機能もサポートしています。

source: It also supports non-character ending keys such as Esc.
ja: また、Escなどの非文字の終了キーにも対応しています。

source: It also works with combination hotkeys (e.g. F1 & e Up::)
ja: 組み合わせホットキー（例：F1 & e Up::）でも動作します

source: It always has the lowest precedence, and thus will fire only if no other variant is eligible.
ja: 常に最も低い優先順位を持つので、他のバリアントが適格でない場合にのみ発火します。

source: It always has the lowest precedence; therefore, it will fire only if no other variant is eligible (this exception does not apply to hotstrings).
ja: 常に最も低い優先順位を持つので、他の variant が適格でない場合にのみ発火します（この例外はホットストリングには適用されません）。

source: It applies only to combo boxes created with the CBS_DROPDOWN style.
ja: CBS_DROPDOWNスタイルで作成されたコンボボックスにのみ適用されます。

source: It can also automate repetitive tasks by sending keystrokes & mouse clicks.
ja: また、キー操作やマウスクリックを送信することで、繰り返し作業を自動化することもできる。

source: It can also be helpful for debugging, such with Func.Name or when displayed on the debugger's call stack.
ja: また、Func.Nameやデバッガのコールスタックに表示されるなど、デバッグに役立つこともある。

source: It can also be manifest in some applications by typing Ctrl+G.
ja: また、アプリケーションによっては、Ctrl+Gを入力することでも表示できます。

source: It can also be manifest in some applications by typing Ctrl+K.
ja: 一部のアプリケーションでは、Ctrl+Kを入力することでも表示できます。

source: It can also be manifest in some applications by typing Ctrl+L.
ja: また、アプリケーションによっては、Ctrl+Lを入力することでも表示できます。

source: It can also be the position of the desired menu item by using 1& to represent the first menu, 2& the second, and so on.
ja: また、1&で1つ目のメニュー、2&で2つ目のメニューを表すなど、目的のメニューの位置を表すことも可能です。

source: It can also be the position of the desired menu item by using "1&" to represent the first menu, "2&" the second, and so on.
ja: また、"1&"で1つ目のメニュー、"2&"で2つ目のメニューを表すなど、目的のメニューの位置を表すことも可能です。

source: It can also be used directly in a Control parameter.
ja: また、Controlパラメータで使用します。

source: It can also be used directly in a WinTitle parameter.
ja: また、WinTitleパラメータで直接使用することも可能です。

source: It can also be used in combination with LoadPicture to avoid loading an image from file multiple times.
ja: また、LoadPictureと組み合わせて使用することで、ファイルから画像を何度も読み込むことを避けることができます。

source: It can also be used to change which If statement an Else statement belongs to, as in this example where the block forces the Else statement to belong to the first If statement rather than the second:
ja: また、Else文がどのIf文に属するかを変更することもできます。この例では、Else文が2番目のIf文ではなく、1番目のIf文に属するようにブロックが強制します：

source: It can also be used to detect the scan code of a non-standard keyboard key using the steps described at the bottom of the key list page (knowing the scan code allows such a key to be made into a hotkey).
ja: また、キー一覧ページの下部に記載されている手順で、非標準キーボードキーのスキャンコードを検出することもできます（スキャンコードを知ることで、そのキーをホットキーにすることができます）。

source: It can also become unreliable, as a longer delay means higher risk of conflict with input by the user, the keyboard focus shifting, or other conditions changing.
ja: また、遅延が長くなると、ユーザーの入力と衝突したり、キーボードのフォーカスがずれたり、その他の条件が変化するリスクが高くなるため、信頼性が低くなる可能性があります。

source: It can also close all windows in a group.
ja: また、グループ内のすべてのウィンドウを閉じることも可能です。

source: It can also hold down a mouse button, turn the mouse wheel, or move the mouse.
ja: ボタンの長押し、ホイールの回転、カーソルの移動も可能です。

source: It can also minimize, maximize, or move the window.
ja: また、ウィンドウの最小化、最大化、移動も可能です。

source: It can also operate temporarily, such as to collect user input or temporarily override specific (or non-specific) keys without interfering with hotkeys.
ja: また、ホットキーに干渉することなく、ユーザー入力の収集や特定（または非特定）キーの一時的な上書きなど、一時的に動作させることも可能です。

source: It can also rename a folder.
ja: また、フォルダ名を変更できます。

source: It can also temporarily disable all timers.
ja: また、すべてのタイマーを一時的に無効化することもできます。

source: It can be an arbitrary string, but should be a negative integer or the name of a running function.
ja: 任意の文字列を指定できますが、負整数または実行中の関数名である必要があります。

source: It can be followed by an Else statement, which executes only if the condition was not met.
ja: その後に、条件が満たされなかった場合にのみ実行されるElse文が続くこともあります。

source: It can be implemented by any of the normal means, including a dynamic property or meta-function, but determining which key was queried would require overriding __Item or Get instead.
ja: 動的プロパティや メタファンクションなど、通常の方法で実装できますが、どのキーが照会されたかを判断するには、代わりに__ItemやGetをオーバーライドする必要があります。

source: It can be located by a different method, which requires the Run function to separate the program name and parameters.
ja: 別の方法で探すことも可能で、その場合はRun関数でプログラム名とパラメータを分離する必要があります。

source: It can be opened via the "AutoHotkey" shortcut in the Start menu after installation, or by directly running UX\ui-dash.ahk from the installation directory.
ja: インストール後、スタートメニューの「AutoHotkey」ショートカットから開くか、インストールディレクトリからUXui-dash.ahkを直接実行して開くことができます。

source: It can be replicated in script easily:
ja: スクリプトで簡単に再現することができます：

source: It can be set to repeat automatically or run only once:
ja: 自動で繰り返す設定や、1回だけ実行する設定も可能です：

source: It can be used to automate Winamp, Windows Media Player, etc.
ja: Winamp、Windows Media Playerなどを自動化するのに使える。

source: It can be used to create a new script file from a preinstalled or user-defined template, and optionally open it for editing.
ja: プリインストールされたテンプレートまたはユーザー定義のテンプレートから新しいスクリプトファイルを作成し、オプションでそれを開いて編集するために使用することができます。

source: It can be utilized by following this example:
ja: この例に従って活用することができる：

source: It can become a subclass of Object by assigning to Base, or the Call method can be reimplemented or copied from another class.
ja: Baseに代入することでObjectのサブクラスになったり、Callメソッドを他のクラスから再実装またはコピーすることができます。

source: It can even be used to open URLs such as https://www.autohotkey.com/ . If your computer is setup to run the type of program you want to run, it's very simple:
ja: https://www.autohotkey.com/などのURLを開くのにも使える。あなたのコンピューターが、実行したいタイプのプログラムを実行できるようにセットアップされていれば、とても簡単だ：

source: It can even be used to open URLs such as https://www.autohotkey.com/.
ja: https://www.autohotkey.com/などのURLを開くのにも使える。

source: It can help debug a script.
ja: スクリプトのデバッグに役立てることができます。

source: It can help you debug a script.
ja: スクリプトのデバッグに役立てることができます。

source: It can make scripts easier to create and maintain since WinTitle and WinText of the target window do not need to be repeated for every windowing function.
ja: ウィンドウ関数のたびにターゲットウィンドウのWinTitleと WinTextを繰り返す必要がないので、スクリプトの作成と保守が簡単になる。

source: It can now accept a HWND (must be a pure integer) or an object with a Hwnd property, such as a GuiControl object.
ja: HWND（純粋な整数でなければならない）またはGuiControlオブジェクトのようなHwndプロパティを持つオブジェクトを受け取ることができるようになりました。

source: It can operate continuously, such as to watch for arbitrary words or other patterns.
ja: 任意の単語や、その他のパターンを監視するなど、連続的に動作させることも可能です。

source: It can return an instance of any of the classes listed above.
ja: 上記のいずれかのクラスのインスタンスを返すことができます。

source: It cannot be called for a load-time error, since OnError cannot be called until after the script has loaded.
ja: OnErrorはスクリプトがロードされた後でないと呼び出せないため、ロードタイムエラーでは呼び出せません。

source: It cannot send keystrokes that are modified by Shift, Ctrl, Alt, or AltGr.
ja: Shift、Ctrl、Alt、AltGrで変更されたキーストロークは送信できない。

source: It contains 1 the first time the loop's body is executed.
ja: ループ本体が最初に実行されるときに1を含む。

source: It contains 1 the first time the loop's expression and body are executed.
ja: ループの式と本体が最初に実行されるとき、ここに1が格納されます。

source: It contains the contents of the current line excluding the carriage return and linefeed (`r`n) that marks the end of the line.
ja: 行末を示すキャリッジリターンとラインフィード（`r`n）を除いた、現在の行の内容が含まれます。

source: It contains the contents of the current substring (field).
ja: 現在の部分文字列（フィールド）の内容を含んでいます。

source: It creates and displays a TreeView containing all folders in the all-users Start Menu.
ja: 全ユーザーのスタートメニューにあるすべてのフォルダを含むTreeViewを作成し、表示します。

source: It defaults to A_ScriptName only when completely omitted, consistent with optional parameters of user-defined functions.
ja: ユーザー定義関数のオプションパラメータと同様に、完全に省略された場合のみ、A_ScriptNameがデフォルトとなります。

source: It displays the files in a folder chosen by the user, with each file assigned the icon associated with its type.
ja: ユーザーが選択したフォルダー内のファイルを表示し、各ファイルにはその種類に関連するアイコンが割り当てられます。

source: It displays the results in a simple ListView.
ja: 結果はシンプルなListViewに表示されます。

source: It does not affect the frequency of message checks while the script is paused or waiting.
ja: スクリプトの一時停止中や待機中のメッセージチェックの頻度には影響しません。

source: It does not appear to be possible to run an executable with a full path which exceeds MAX_PATH.
ja: MAX_PATHを超えるフルパスで実行ファイルを実行することはできないようです。

source: It does not persist after logout, but was still undesirable to some users.
ja: ログアウト後も持続しないが、それでも一部のユーザーには好ましくないものだった。

source: It does not wait for acknowledgement or reply.
ja: 確認や返信を待つことはありません。

source: It does this by checking the script for clues about which version it requires, and then locating an appropriate exe to run the script.
ja: これは、スクリプトに必要なバージョンの手がかりをチェックし、スクリプトを実行するための適切なexeを見つけることによって行われる。

source: It does this by keeping the hotkey's thread running, which blocks the auto-repeats by relying upon #MaxThreadsPerHotkey being at its default setting of 1.
ja: これは、ホットキーのスレッドを実行し続けることで、#MaxThreadsPerHotkeyがデフォルト設定の1であることを頼りに、自動繰り返しをブロックすることで実現します。

source: It enables users to edit within the client area of the control when they press F2.
ja: F2を押すと、コントロールのクライアント・エリア内で編集できるようになる。

source: It evaluates the condition on its left side to determine which of its two branches should become its final result.
ja: 左辺の条件を評価し、2つの分岐のどちらが最終的な結果になるかを決定する。

source: It excludes the window's title bar, menu (if it has a standard one) and borders.
ja: ウィンドウのタイトルバー、メニュー（標準のものがある場合）、ボーダーは除外されます。

source: It has neither default styles nor forced styles.
ja: デフォルトスタイルも強制スタイルもない。

source: It has no default styles.
ja: デフォルトのスタイルはない。

source: It has no effect on Windows 32-bit.
ja: Windows 32ビットでは効果がありません。

source: It has no effect when used on an existing control; however, this may change in a future version.
ja: 既存のコントロールに使用しても効果はありませんが、将来のバージョンで変更される可能性があります。

source: It has no forced styles.
ja: 強制的なスタイルはない。

source: It has the following effects:
ja: 以下のような効果があります：

source: It increases A_Index by 1.
ja: A_Indexを1つ増加させます。

source: It is a key or key combination that the person at the keyboard presses to trigger some actions.
ja: これは、キーボードの人が何らかのアクションを起こすために押すキー、またはキーの組み合わせである。

source: It is a quick way to create an object with a short set of known properties.
ja: これは、既知のプロパティの短いセットを持つオブジェクトを素早く作成する方法です。

source: It is actually calling the Array class, not a function.
ja: これは実際には関数ではなくArrayクラスを呼び出している。

source: It is also automatically destroyed when its owner is destroyed.
ja: また、所有者が破壊されると自動的に破壊されます。

source: It is also called whenever #SingleInstance and Reload ask a previous instance to terminate.
ja: また、#SingleInstanceや Reloadで前のインスタンスの終了を要求されたときにも呼び出されます。

source: It is also installed for hotstrings, but that can be disabled via #Hotstring NoMouse.
ja: ホットストリングにもインストールされますが、それは#Hotstring NoMouseで無効にすることができます。

source: It is also launched in response to pressing Menu or Shift+F10.
ja: また、Menuや Shift+F10を押したときにも反応し、起動します。

source: It is also passed as a parameter whenever an event handler (the replacement of a g-label) is called.
ja: また、イベントハンドラ（g-labelの置き換え）が呼ばれるたびに、パラメータとして渡されます。

source: It is also possible to have a different large icon for a window than its small icon (the large icon is displayed in the alt-tab task switcher).
ja: また、ウィンドウの大アイコンを小アイコンと異なるものにすることも可能です（大アイコンはalt-tabタスクスイッチャーに表示されます）。

source: It is also possible to set a control's font directly, with GuiControl.SetFont().
ja: また、GuiControl.SetFont()で、コントロールのフォントを直接設定することも可能です。

source: It is also possible to set a control's font directly, with GuiCtrl.SetFont().
ja: また、GuiCtrl.SetFont()で、コントロールのフォントを直接設定することも可能です。

source: It is also valid to combine an assignment with the reference operator, as in &(Var := "initial value").
ja: また、&(Var := "初期値")のように、代入と参照演算子を組み合わせることも有効である。

source: It is also valid to omit */, in which case the remainder of the file is commented out.
ja: */を省略することも有効です。 この場合、ファイルの残りはコメントアウトされます。

source: It is also valid to use {Raw} or {Text} with ControlSend.
ja: ControlSendで{Raw}や {Text}を使用することも有効です。

source: It is always null-terminated, but the null-terminator is not included in the return value's length except when Length is negative as described above.
ja: これは常にヌル終端であるが、上述のようにLengthが負の場合を除き、ヌル終端は返り値の長さに含まれない。

source: It is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: 絶対パスが指定されていない場合は、A_WorkingDirにあるとみなされます。

source: It is available here:
ja: ここで入手できる：

source: It is available here: https://github.com/zufuliu/notepad2
ja: ここで入手できる：https://github.com/zufuliu/notepad2

source: It is best not to insert or delete columns directly with SendMessage.
ja: SendMessageで直接カラムの挿入や削除を行わない方がよいでしょう。

source: It is best not to store a reference to a closure in any of the closure's own free variables, since that creates a circular reference which must be broken (such as by clearing the variable) before the closure can be freed.
ja: クロージャへの参照をクロージャ自身の自由変数に格納しないのが最善です。これは循環参照を作成し、クロージャを解放する前に（その変数をクリアするなどして）破棄しなければならないからです。

source: It is best to escape every literal colon in these cases to avoid confusion (but a single isolated colon need not be escaped).
ja: このような場合、混乱を避けるために、リテラルなコロンをすべてエスケープするのが最善です（ただし、孤立した1つのコロンはエスケープする必要はありません）。

source: It is currently not possible to specify a different set of end characters for each hotstring.
ja: 現在、ホットストリングごとに異なる終了文字のセットを指定することはできません。

source: It is demonstrated at www.autohotkey.com/forum/topic19021.html
ja: www.autohotkey.com/forum/topic19021.htmlにデモンストレーションがあります。

source: It is designed for PHP, but also works with AutoHotkey.
ja: PHP用に設計されていますが、AutoHotkeyでも動作します。

source: It is destroyed automatically when the menu object is deleted (which occurs when its reference count reaches zero).
ja: メニューオブジェクトが削除されたとき（参照カウントがゼロになったとき）に、自動的に破棄されます。
